var TFilms = [
	{
		'id':1,
		'poster':'1.jpg',
		'film':'Мадам Павутина',
		'genre':'Фантастика / Екшн',
		'producer':'Бенжамін Реннер',
		'actors':'Дакота Джонсон, Сідні Свіні, Ізабела Мерсед, Селеста О’Коннор, Адам Скотт, Тахар Рахім, Емма Робертс, Заша Мемет, Майк Еппс',
		'company':'Universal Pictures, Illumination Entertainment',
		'country':'США',
		'year':'2024',
		'time':'90 хв.',
		'lang':'Українська',
		'format':'2D',
		'short':'Зустрічайте одну з найзагадковіших героїнь кіновсесвіту Marvel «Мадам Павутину»! Дакота Джонсон у ролі Кассандри Вебб – парамедикині з Мангеттену – виявляє в собі здібності до ясновидіння. Зіткнувшись з одкровеннями щодо минулого, вона знайомиться з трьома молодими жінками, яким судилося потужне майбутнє. Та чи вдасться їм пережити фатальне сьогодення?',
		'sessions':[
		    {'id':1, 'dt':'2024.04.07', 'tm':'12:00', 'hall':'червона зала', 'tickets':1},
			{'id':2, 'dt':'2024.04.07', 'tm':'14:00', 'hall':'синя зала', 'tickets':1},
			{'id':3, 'dt':'2024.04.08', 'tm':'16:00', 'hall':'червона зала', 'tickets':0}
		]
	},

	{
		'id':2,
		'poster':'2.jpg',
		'film':'Дюна',
		'genre':'Драма / Фантастика / Пригоди',
		'producer':'Дені Вільньов',
		'actors':'Тімоті Шаламе, Ребекка Ферґюсон, Оскар Айзек, Джош Бролін, Джейсон Момоа, Зендая Коулман, Стеллан Скашґорд, Хав\'єр Бардем, Дейв Батіста, Шарлотта Ремплінґ',
		'company':'Warner Bros. Pictures, Legendary Pictures',
		'country':'США, Канада, Угорщина',
		'year':'2021',
		'time':'155 хв.',
		'lang':'Українська',
		'format':'3D',
		'short':'Міфічна і емоційно заряджена подорож головного героя, Пола Атріда. На цього блискучого і обдарованого хлопця чекають великі справи, які йому важко осягнути. Він вирушить на найнебезпечнішу планету у Всесвіті, щоб врятувати майбутнє своєї родини і свого народу. Адже ворожі сили вступають у конфлікт через найцінніший і найрідкісніший ресурс – речовину, здатну розкрити найбільший потенціал людства. Виживуть лише ті, кому вдасться перемогти власні страхи.',
		'sessions':[
		    {'id':4, 'dt':'2024.04.07', 'tm':'12:00', 'hall':'синя зала', 'tickets':1},
			{'id':5, 'dt':'2024.04.07', 'tm':'14:00', 'hall':'червона зала', 'tickets':1},
			{'id':6, 'dt':'2024.04.08', 'tm':'14:00', 'hall':'червона зала', 'tickets':1}
		]
	},

	{
		'id':3,
		'poster':'3.jpg',
		'film':'Арґайл',
		'genre':'Пригоди / Екшн',
		'producer':'Метью Вон',
		'actors':'Генрі Кавілл, Брайс Даллас Говард, Сем Роквелл, Браян Кренстон, Семюел Л. Джексон, Джон Сіна, Дуа Ліпа, Кетрін О’Гара, Роб Делані, Софія Бутелла',
		'company':'Universal Pictures, Marv Studios',
		'country':'США, Великобританія',
		'year':'2024',
		'time':'90 хв.',
		'lang':'Українська',
		'format':'2D',
		'short':'Популярна авторка шпигунських бестселерів Еллі Конвей обожнює проводити час вдома за комп’ютером і в компанії улюбленого кота Алфі. Проте коли сюжети вигаданих книг Еллі, в центрі яких — секретний агент Арґайл та його місія з розкриття глобального шпигунського синдикату, починають відображати таємні дії реальної шпигунської організації, тихі домашні вечори залишаються в минулому.',
		'sessions': [
			{'id':7, 'dt':'2024.04.09', 'tm':'12:00', 'hall':'синя зала', 'tickets':1},
			{'id':8, 'dt':'2024.04.09', 'tm':'14:00', 'hall':'червона зала', 'tickets':1},
			{'id':9, 'dt':'2024.04.10', 'tm':'14:00', 'hall':'червона зала', 'tickets':1}
		]
	},

	{
		'id':4,
		'poster':'4.jpg',
		'film':'Бджоляр',
		'genre':'Бойовик ',
		'producer':'Девід Еєр',
		'actors':'Джейсон Стейтем, Джеремі Айронс, Еммі Рейвер-Лемпман та Джош Гатчерсон',
		'company':'Amazon MGM, Metro-Goldwyn-Mayer Pictures',
		'country':'США',
		'year':'2024',
		'time':'90 хв.',
		'lang':'Українська',
		'format':'3D',
		'short':'Спокійне життя головного героя бойовика – ексоперативника суперсекретної організації "Бджолярі" Адама Клея – закінчується після того, як гине його давня знайома. Чоловік вирішує помститися за її смерть. Адам знову застосовує свої "унікальні навички", щоб розкрити корупцію всередині великої компанії.',
		'sessions': [
			{'id':10, 'dt':'2024.02.11', 'tm':'12:00', 'hall':'синя зала', 'tickets':1},
			{'id':11, 'dt':'2024.02.11', 'tm':'14:00', 'hall':'червона зала', 'tickets':1},
			{'id':12, 'dt':'2024.02.12', 'tm':'14:00', 'hall':'червона зала', 'tickets':1}
		]
	},

	{
		'id':5,
		'poster':'5.jpg',
		'film':'Люблю тебе ненавидіти',
		'genre':'Комедія',
		'producer':'Вілл Ґлак',
		'actors':'Сідні Свіні, Ґлен Павелл, Александра Шіпп, Даррен Барнет, Браян Браун, Рейчел Ґріффітс, Дермот Малруні, Гедлі Робінсон',
		'company':'Sony Pictures Entertainment',
		'country':'США',
		'year':'2024',
		'time':'103 хв.',
		'lang':'Українська',
		'format':'2D',
		'short':'На ранок після ідеального першого побачення фатальна пристрасть закоханих перетворюється на холодну ненависть, доки доля не зводить їх разом на весіллі друзів в Австралії. Тож їм не залишається нічого іншого, окрім як вчинити по-дорослому і знову прикинутися парою.',
		'sessions': [
			{'id':13, 'dt':'2024.02.07', 'tm':'12:00', 'hall':'синя зала', 'tickets':1},
			{'id':14, 'dt':'2024.02.07', 'tm':'14:00', 'hall':'червона зала', 'tickets':1},
			{'id':15, 'dt':'2024.02.08', 'tm':'14:00', 'hall':'червона зала', 'tickets':1}
		]
	},

	{
		'id':6,
		'poster':'5.jpg',
		'film':'Люблю тебе ненавидіти',
		'genre':'Комедія',
		'producer':'Вілл Ґлак',
		'actors':'Сідні Свіні, Ґлен Павелл, Александра Шіпп, Даррен Барнет, Браян Браун, Рейчел Ґріффітс, Дермот Малруні, Гедлі Робінсон',
		'company':'Sony Pictures Entertainment',
		'country':'США',
		'year':'2024',
		'time':'103 хв.',
		'lang':'Українська',
		'format':'2D',
		'short':'На ранок після ідеального першого побачення фатальна пристрасть закоханих перетворюється на холодну ненависть, доки доля не зводить їх разом на весіллі друзів в Австралії. Тож їм не залишається нічого іншого, окрім як вчинити по-дорослому і знову прикинутися парою.',
		'sessions': [
			{'id':16, 'dt':'2024.02.07', 'tm':'12:00', 'hall':'синя зала', 'tickets':1},
			{'id':17, 'dt':'2024.02.07', 'tm':'14:00', 'hall':'червона зала', 'tickets':1},
			{'id':18, 'dt':'2024.02.08', 'tm':'14:00', 'hall':'червона зала', 'tickets':1}
		]
	}
];

var THalls = [
	{
		id:1,
		hallname:"Червона зала", 
		color: 'red',
	    countplaces:500,
	    places:[
	    	{row:2,place:15,price:150}, 
	    	{row:5, place:20,price:120}, 
	    	{row:8, place:25,price:100},
	    	{row:4, place:30,price:80},
	    ]
	},

	{
		id:2,
		hallname:"Синя зала", 
		color: 'blue',
	    countplaces:400,
	    places:[
	    	{row:3,place:10,price:140}, 
	    	{row:10, place:20,price:110},
	    	{row:5, place:25,price:90},
	    ]
	},

	{
		id:3,
		hallname:"Зелена зала", 
		color: 'green',
	    countplaces:200,
	    places:[
	    	{row:8, place:18, price:100},
	    	{row:2, place:20, price:80},
	    ]
	}
];

var TSessions = [
	{
		'id':1,
		'id_film': 1,
		'film':'Мадам Павутина',
		'dt':'07.03.2024',
		'tbegin':'12:00',
		'id_hall':1,
		'hall':'червона зала',
		'color':'red'
	},

	{
		'id':2,
		'id_film':1,
		'film':'Мадам Павутина',
		'dt':'07.03.2024',
		'tbegin':'14:00',
		'id_hall':3,
		'hall':'зелена зала',
		'color':'green'
	},

	{
		'id':3,
		'id_film': 1,
		'film':'Мадам Павутина',
		'dt':'07.03.2024',
		'tbegin':'16:00',
		'id_hall':1,
		'hall':'червона зала',
		'color':'red'
	},

	{
		'id':4,
		'id_film': 2,
		'film':'Дюна',
		'dt':'07.03.2024',
		'tbegin':'12:00',
		'id_hall':1,
		'hall': 'червона зала',
		'color':'red'
	},

	{
		'id':5,
		'id_film': 2,
		'film':'Дюна',
		'dt':'07.03.2024',
		'tbegin':'12:00',
		'id_hall':2,
		'hall': 'синя зала',
		'color':'blue'
	},

	{
		'id':6,
		'id_film': 2,
		'film':'Дюна',
		'dt':'07.03.2024',
		'tbegin':'12:00',
		'id_hall':2,
		'hall': 'синя зала',
		'color':'blue'
	},

	{
		'id':7,
		'id_film': 3,
		'film':'Арґайл',
		'dt':'07.03.2024',
		'tbegin':'12:00',
		'id_hall':1,
		'hall': 'червона зала',
		'color':'red'
	},

	{
		'id':8,
		'id_film': 3,
		'film':'Арґайл',
		'dt':'07.03.2024',
		'tbegin':'12:00',
		'id_hall':1,
		'hall': 'синя зала',
		'color':'blue'
	},

	{
		'id':9,
		'id_film': 4,
		'film':'Бджоляр',
		'dt':'07.03.2024',
		'tbegin':'12:00',
		'id_hall':1,
		'hall': 'червона зала',
		'color':'red'
	},

	{
		'id':10,
		'id_film': 4,
		'film':'Бджоляр',
		'dt':'07.03.2024',
		'tbegin':'12:00',
		'id_hall':1,
		'hall': 'синя зала',
		'color':'blue'
	},

	{
		'id':11,
		'id_film': 3,
		'film':'Арґайл',
		'dt':'07.03.2024',
		'tbegin':'12:00',
		'id_hall':2,
		'hall': 'синя зала',
		'color':'blue'
	},

	{
		'id':12,
		'id_film': 4,
		'film':'Бджоляр',
		'dt':'07.03.2024',
		'tbegin':'12:00',
		'id_hall':4,
		'hall': 'червона зала',
		'color':'red'
	},

	{
		'id':13,
		'id_film': 5,
		'film':'Люблю тебе ненавидіти',
		'dt':'07.03.2024',
		'tbegin':'12:00',
		'id_hall':1,
		'hall': 'синя зала',
		'color':'blue'
	},

	{
		'id':14,
		'id_film': 5,
		'film':'Люблю тебе ненавидіти',
		'dt':'07.03.2024',
		'tbegin':'12:00',
		'id_hall':1,
		'hall': 'червона зала',
		'color':'red'
	},

	{
		'id':15,
		'id_film': 5,
		'film':'Люблю тебе ненавидіти',
		'dt':'07.03.2024',
		'tbegin':'12:00',
		'id_hall':1,
		'hall': 'синя зала',
		'color':'blue'
	}
];

var TTickets = [
	{
		'id':1,
		'id_session': 1,
		'row':2,
		'place':12,
		'price':100
	},

	{
		'id':2,
		'id_session': 1,
		'row':2,
		'place':14,
		'price':100
	},
]